# Data Exploration

In [10]:
import pandas as pd
import numpy as np
import warnings 
from warnings import filterwarnings
filterwarnings('ignore')

In [ ]:
df = pd.read_csv("\data\car_data.csv")

In [12]:
df.head()

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
0,Maruti 800 AC,2007.0,NaN,70000.0,Petrrol,NaN,Manual,First Owner
1,Maruti Wagon R LXI Minor,NaN,135000.0,50000.0,Petorl,Indvidual,Manual,First Owner
2,Hyundai Verna 1.6 SX,2012.0,600000.0,100000.0,Deisel,Indvidual,Manual,First Owner
3,Datsun RediGO T Option,2017.0,250000.0,46000.0,Petorl,Indivudal,Manual,First Owner
4,Honda Amaze VX i-DTEC,2014.0,450000.0,141000.0,Diesl,Indivudal,Manual,Second Owner

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4345 entries, 0 to 4344
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4017 non-null   object
 1   year           4041 non-null   float64
 2   selling_price  4054 non-null   float64
 3   km_driven      4026 non-null   object
 4   fuel           4042 non-null   object
 5   seller_type    4056 non-null   object
 6   transmission   4040 non-null   object
 7   owner          4059 non-null   object
dtypes: float64(2), object(6)
memory usage: 271.7+ KB

In [14]:
df.describe()

              year  selling_price
count  4041.000000   4.054000e+03
mean   2013.276417   5.026554e+05
std      16.556865   5.804930e+05
min    1800.000000  -1.200000e+05
25%    2011.000000   2.000000e+05
50%    2014.000000   3.500000e+05
75%    2016.000000   6.000000e+05
max    3000.000000   8.900000e+06

In [15]:
df.describe(include='object')

,name,km_driven,fuel,seller_type,transmission,owner
count,4017,4026,4042,4056,4040,4059
unique,1438,743,8,5,2,5
top,Maruti Swift Dzire VDI,70000.0,Diesl,Indivudal,Manual,First Owner
freq,67,224,1013,1531,3611,2654

# CLeaning

### Correcting the datatype of columns

Notice the datatype of th column 'km_driven'

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4345 entries, 0 to 4344
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4017 non-null   object
 1   year           4041 non-null   float64
 2   selling_price  4054 non-null   float64
 3   km_driven      4026 non-null   object
 4   fuel           4042 non-null   object
 5   seller_type    4056 non-null   object
 6   transmission   4040 non-null   object
 7   owner          4059 non-null   object
dtypes: float64(2), object(6)
memory usage: 271.7+ KB

In [17]:
df['km_driven']=pd.to_numeric(df['km_driven'],errors='coerce')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4345 entries, 0 to 4344
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           4017 non-null   object
 1   year           4041 non-null   float64
 2   selling_price  4054 non-null   float64
 3   km_driven      4022 non-null   float64
 4   fuel           4042 non-null   object
 5   seller_type    4056 non-null   object
 6   transmission   4040 non-null   object
 7   owner          4059 non-null   object
dtypes: float64(3), object(5)
memory usage: 271.7+ KB

### Correcting categories

Notice the wrong spelling of the categories 'Petrol', 'Deisel', 'Individual' and 'Dealer'

In [18]:
cat_cols = df.select_dtypes('object')
for col in cat_cols:
    print(f"{col} ({(len(df[col].unique()))}) :")
    print(df[col].unique())
    print("_" * 60)

name (1439) :
['Maruti 800 AC' 'Maruti Wagon R LXI Minor' 'Hyundai Verna 1.6 SX' ...
 'Mahindra Verito 1.5 D6 BSIII'
 'Toyota Innova 2.5 VX (Diesel) 8 Seater BS IV'
 'Hyundai i20 Magna 1.4 CRDi']
____________________________________________________________
fuel (9) :
['Petrrol' 'Petorl' 'Deisel' 'Diesl' 'Petrl' 'CNG' nan 'LPG' 'Electric']
____________________________________________________________
seller_type (6) :
[nan 'Indvidual' 'Indivudal' 'Deelar' 'Dealerr' 'Trustmark Dealer']
____________________________________________________________
transmission (3) :
['Manual' nan 'Automatic']
____________________________________________________________
owner (6) :
['First Owner' 'Second Owner' nan 'Fourth & Above Owner' 'Third Owner'
 'Test Drive Car']
____________________________________________________________

In [19]:
df['fuel'] = df['fuel'].replace({
    'Deisel': 'Diesel',
    'Diesl': 'Diesel',
    'Petorl': 'Petrol',
    'Petrl': 'Petrol',
    'Petrrol': 'Petrol'
})

df['seller_type'] = df['seller_type'].replace({
    'Indvidual': 'Individual',
    'Indivudal': 'Individual',
    'Deelar': 'Dealer',
    'Dealerr': 'Dealer'
})

### Checking for duplicates

In [20]:
df.duplicated().sum()

np.int64(313)

In [21]:
df.drop_duplicates(inplace=True)

### Dealing with outliers

In [22]:
df[(df['year']>2025)]['year']

2866    3000.0
4037    2050.0
Name: year, dtype: float64

In [23]:
df[(df['year']<1950)]['year']

997     1890.0
1651    1800.0
Name: year, dtype: float64

In [24]:
df = df[df["year"].between(1990, 2025)]

In [25]:
df[(df['selling_price']<0)]['selling_price']

853     -50000.0
1741     -9999.0
2545     -4500.0
4094   -120000.0
Name: selling_price, dtype: float64

In [26]:
df=df[(df['selling_price']>0)]
df.describe()

              year  selling_price     km_driven
count  3450.000000   3.450000e+03  3.173000e+03
mean   2013.024348   4.851658e+05  8.919306e+04
std       4.250218   5.291536e+05  9.158361e+05
min    1992.000000   2.000000e+04  1.000000e+00
25%    2010.000000   2.000000e+05  3.500000e+04
50%    2014.000000   3.500000e+05  6.000000e+04
75%    2016.000000   6.000000e+05  9.000000e+04
max    2020.000000   8.150000e+06  5.000000e+07

In [27]:
num_cols = ['selling_price', 'km_driven']

for col in num_cols:
    Q1 = df[col].quantile(0.25)
    Q3 = df[col].quantile(0.75)
    IQR = Q3 - Q1

    lower = Q1 - 1.5 * IQR
    upper = Q3 + 1.5 * IQR
    
    low_outliers = df[df[col] <= lower][col].sort_values(ascending=False)
    high_outliers = df[df[col] >= upper][col].sort_values(ascending=False)

    print(f"\nOutliers for {col}:")
    print("Lower:")
    print(low_outliers)
    print("Upper:")
    print(high_outliers)

Outliers for selling_price:
Lower:
Series([], Name: selling_price, dtype: float64)
Upper:
89      8150000.0
3969    5500000.0
574     4950000.0
612     4950000.0
2739    4950000.0
          ...
2910    1200000.0
2655    1200000.0
2921    1200000.0
2699    1200000.0
3626    1200000.0
Name: selling_price, Length: 190, dtype: float64

Outliers for km_driven:
Lower:
Series([], Name: km_driven, dtype: float64)
Upper:
2102    50000000.0
3594     9999999.0
4218     8000000.0
1243      806599.0
525       560000.0
           ...
3475      175000.0
3800      175000.0
3533      175000.0
4331      175000.0
2796      173000.0
Name: km_driven, Length: 90, dtype: float64

In [28]:
df.drop([2102,3594,4218,1243,525,89],inplace=True)

### Filling NAN's

The columns 'year' and 'selling_price' have no missing values

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3444 entries, 2 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           3165 non-null   object
 1   year           3444 non-null   float64
 2   selling_price  3444 non-null   float64
 3   km_driven      3167 non-null   float64
 4   fuel           3184 non-null   object
 5   seller_type    3199 non-null   object
 6   transmission   3184 non-null   object
 7   owner          3208 non-null   object
dtypes: float64(3), object(5)
memory usage: 242.2+ KB

Using the median to fill the missing values as it's robust to skewness and extreme values

In [30]:
df['km_driven'].median()

np.float64(60000.0)

In [31]:
df['km_driven'].fillna(df['km_driven'].median(),inplace=True)

Filling the missing values in the categorical columns with the mode

In [32]:
cat_cols = df.select_dtypes('object').columns
for col in cat_cols:
    df[col].fillna(df[col].mode()[0],inplace=True)

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3444 entries, 2 to 4339
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   name           3444 non-null   object
 1   year           3444 non-null   float64
 2   selling_price  3444 non-null   float64
 3   km_driven      3444 non-null   float64
 4   fuel           3444 non-null   object
 5   seller_type    3444 non-null   object
 6   transmission   3444 non-null   object
 7   owner          3444 non-null   object
dtypes: float64(3), object(5)
memory usage: 242.2+ KB

In [34]:
df.describe(include='all')

,name,year,selling_price,km_driven,fuel,seller_type,transmission,owner
count,3444,3444.000000,3.444000e+03,3444.000000,3444,3444,3444,3444
unique,1330,NaN,NaN,NaN,5,3,2,5
top,Maruti Swift Dzire VDI,NaN,NaN,NaN,Diesel,Individual,Manual,First Owner
freq,328,NaN,NaN,NaN,1825,2739,3131,2312
mean,NaN,2013.021196,4.828360e+05,66857.279907,NaN,NaN,NaN,NaN
std,NaN,4.251649,5.131304e+05,43162.151391,NaN,NaN,NaN,NaN
min,NaN,1992.000000,2.000000e+04,1.000000,NaN,NaN,NaN,NaN
25%,NaN,2010.000000,2.000000e+05,39000.000000,NaN,NaN,NaN,NaN
50%,NaN,2014.000000,3.500000e+05,60000.000000,NaN,NaN,NaN,NaN
75%,NaN,2016.000000,6.000000e+05,90000.000000,NaN,NaN,NaN,NaN
max,NaN,2020.000000,5.500000e+06,400000.000000,NaN,NaN,NaN,NaN

### Final check for duplicates after filling missing values

In [35]:
df.duplicated().sum()

np.int64(99)

In [36]:
df.drop_duplicates(inplace=True)

# Final

In [37]:
df.to_csv('car_data_cleaned.csv',index=False)